# Hands On

In [37]:
import numpy as np
import pandas as pd

In [38]:
df = pd.DataFrame({
    'Sex' : ['M', 'F', 'F', 'D', '?'],
    'Age' : [29, 30, 24, 290, 25],
})
df

  Sex  Age
0   M   29
1   F   30
2   F   24
3   D  290
4   ?   25

In [39]:
df['Sex'].unique()

array(['M', 'F', 'D', '?'], dtype=object)

In [40]:
df['Sex'].value_counts()

Sex
F    2
M    1
D    1
?    1
Name: count, dtype: int64

In [41]:
df['Sex'].replace('D', 'F')

0    M
1    F
2    F
3    F
4    ?
Name: Sex, dtype: object

In [42]:
df['Sex'].replace({'D' : 'F', 'N' : 'M'})

0    M
1    F
2    F
3    F
4    ?
Name: Sex, dtype: object

In [43]:
df.replace({
    'Sex' : {
        'D' : 'F',
        'N' : 'M'
    },
    'Age' : {
        290 : 29
    }
})

  Sex  Age
0   M   29
1   F   30
2   F   24
3   F   29
4   ?   25

In [44]:
df[df['Age'] > 100]

  Sex  Age
3   D  290

In [45]:
df.loc[df['Age'] > 100, 'Age'] /= 10

In [46]:
df

  Sex  Age
0   M   29
1   F   30
2   F   24
3   D   29
4   ?   25

# Duplicates

In [47]:
ambassadors = pd.Series([
    'France',
    'United Kingdom',
    'United Kingdom',
    'Italy',
    'Germany',
    'Germany',
    'Germany',
], index=[
    'GÃ©rard Araud',
    'Kim Darroch',
    'Peter Westmacott',
    'Armando Varricchio',
    'Peter Wittig',
    'Peter Ammon',
    'Klaus Scharioth '
])

In [48]:
ambassadors

GÃ©rard Araud                  France
Kim Darroch           United Kingdom
Peter Westmacott      United Kingdom
Armando Varricchio             Italy
Peter Wittig                 Germany
Peter Ammon                  Germany
Klaus Scharioth              Germany
dtype: object

In [49]:
ambassadors.duplicated()

GÃ©rard Araud          False
Kim Darroch           False
Peter Westmacott       True
Armando Varricchio    False
Peter Wittig          False
Peter Ammon            True
Klaus Scharioth        True
dtype: bool

In [50]:
ambassadors.duplicated(keep='last')

GÃ©rard Araud          False
Kim Darroch            True
Peter Westmacott      False
Armando Varricchio    False
Peter Wittig           True
Peter Ammon            True
Klaus Scharioth       False
dtype: bool

In [51]:
ambassadors.duplicated(keep=False)

GÃ©rard Araud          False
Kim Darroch            True
Peter Westmacott       True
Armando Varricchio    False
Peter Wittig           True
Peter Ammon            True
Klaus Scharioth        True
dtype: bool

In [52]:
ambassadors.drop_duplicates()

GÃ©rard Araud                  France
Kim Darroch           United Kingdom
Armando Varricchio             Italy
Peter Wittig                 Germany
dtype: object

In [53]:
ambassadors.drop_duplicates(keep='last')

GÃ©rard Araud                  France
Peter Westmacott      United Kingdom
Armando Varricchio             Italy
Klaus Scharioth              Germany
dtype: object

In [54]:
ambassadors.drop_duplicates(keep=False)

GÃ©rard Araud          France
Armando Varricchio     Italy
dtype: object

# Duplicates in DataFrames

In [55]:
players = pd.DataFrame({
    'Name': [
        'Kobe Bryant',
        'LeBron James',
        'Kobe Bryant',
        'Carmelo Anthony',
        'Kobe Bryant',
    ],
    'Pos': [
        'SG',
        'SF',
        'SG',
        'SF',
        'SF'
    ]
})

In [56]:
players

              Name Pos
0      Kobe Bryant  SG
1     LeBron James  SF
2      Kobe Bryant  SG
3  Carmelo Anthony  SF
4      Kobe Bryant  SF

In [57]:
players.duplicated()

0    False
1    False
2     True
3    False
4    False
dtype: bool

In [58]:
players.duplicated(subset=['Name'])

0    False
1    False
2     True
3    False
4     True
dtype: bool

In [59]:
players.duplicated(subset=['Name'], keep='last')

0     True
1    False
2     True
3    False
4    False
dtype: bool

In [60]:
players.drop_duplicates(subset=['Name'])

              Name Pos
0      Kobe Bryant  SG
1     LeBron James  SF
3  Carmelo Anthony  SF

In [61]:
players.drop_duplicates(subset=['Name'], keep='last')

              Name Pos
1     LeBron James  SF
3  Carmelo Anthony  SF
4      Kobe Bryant  SF

# Text Handling

# Splitting Columns

In [62]:
df = pd.DataFrame({
    'Data': [
        '1987_M_US _1',
        '1990?_M_UK_1',
        '1992_F_US_2',
        '1970?_M_   IT_1',
        '1985_F_I  T_2'
]})

In [63]:
df

              Data
0     1987_M_US _1
1     1990?_M_UK_1
2      1992_F_US_2
3  1970?_M_   IT_1
4    1985_F_I  T_2

In [64]:
df['Data'].str.split('_')

0       [1987, M, US , 1]
1       [1990?, M, UK, 1]
2        [1992, F, US, 2]
3    [1970?, M,    IT, 1]
4      [1985, F, I  T, 2]
Name: Data, dtype: object

In [65]:
df['Data'].str.split('_', expand=True)

       0  1      2  3
0   1987  M    US   1
1  1990?  M     UK  1
2   1992  F     US  2
3  1970?  M     IT  1
4   1985  F   I  T  2

In [66]:
df = df['Data'].str.split('_', expand=True)

In [67]:
df.columns = ['Year', 'Sex', 'Country', 'N of Children']

In [68]:
df

    Year Sex Country N of Children
0   1987   M     US              1
1  1990?   M      UK             1
2   1992   F      US             2
3  1970?   M      IT             1
4   1985   F    I  T             2

In [69]:
df['Year'].str.contains('\?')

0    False
1     True
2    False
3     True
4    False
Name: Year, dtype: bool

In [70]:
df['Country'].str.contains('u')

0    False
1    False
2    False
3    False
4    False
Name: Country, dtype: bool

In [71]:
df['Country'].str.strip()

0      US
1      UK
2      US
3      IT
4    I  T
Name: Country, dtype: object

In [72]:
df['Country'].str.replace(' ', '')

0    US
1    UK
2    US
3    IT
4    IT
Name: Country, dtype: object

In [74]:
df['Year'].str.replace(r'(?P<year>\d{4})\?', lambda m : m.group('year'), regex=True)

0    1987
1    1990
2    1992
3    1970
4    1985
Name: Year, dtype: object